app/services/price_update_service.rb

SELECT "alerts".* FROM "alerts" WHERE "alerts"."cryptocurrency" = $1 AND "alerts"."target_price" = $2  [["cryptocurrency", "[FILTERED]"], ["target_price", "57456.01"]]
---
  def process_message(data)
    # Implement your logic to handle incoming data
    # Example: Store trade data in the database, notify users, etc.
    puts data, 'dddddddddddddddddddddddddddd'
    # not sure if we have to track the direction in which the bitcoin is moving in the alerts
    # assuming that reaching the exact price is what is required from the wording.
    alerts = Alert.where(cryptocurrency: 'BTC', target_price: data['p'], status: :created)