app/controllers/alerts_controller.rb

  def create
    puts 'jjjjjjjjjjjjjjjjjccccccccccc', alert_params, 'apppppppppppppppppppppp'

    if @user
      puts 'ahhhhhhhhhhhh', alert_params, 'hhhhhhaaaaaaaaaaaaaaaa'
      @alert = Alert.new(alert_params.merge(status: :created, user: @user))
    else
      if params[:user_name].blank? || params[:email].blank?
        puts alert_params, 'whattttttttteevvvvvvvvvvvverrrr'
        return render json: { success: false, message: 'please provide user_name and email parameter for new user'}
      end
      puts 'owmsya'
      @user = User.create!(name: params[:user_name], email: params[:email])
      @alert = Alert.new(alert_params.merge(status: :created, user: @user))
    end
    if @alert.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "prasanna"], ["email", "[FILTERED]"], ["created_at", "2024-09-11 22:13:21.880220"], ["updated_at", "2024-09-11 22:13:21.880220"]]
INSERT INTO "alerts" ("user_id", "cryptocurrency", "name", "target_price", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def index
    unless @user
      render json: {success: false, message: 'User not found'}
    end
    # Cache based on user id and status, status can be nil
    cache_key = "alerts_user_#{@user.id}_status_#{params[:status]}"

    #if fails hit postgres
    alerts = Rails.cache.fetch(cache_key, expires_in: 24.hours) do
      unless params[:status].blank?
        puts 'hsd'
        @alerts = @user.alerts.where(status: params[:status].to_sym)
      else
        puts 'hsr'
        @alerts = @user.alerts
      end
      puts @alerts, '@alertttttttttsssssssssssssssszzzzzzzzzzzzzz'
      @alerts.select(:name, :status, :target_price)
    end
    paginated_alerts = alerts.page(params[:page]).per(params[:per_page] || 20)
---
SELECT "alerts".* FROM "alerts" WHERE "alerts"."user_id" = $1 AND "alerts"."status" = $2  [["user_id", 1], ["status", 0]]
SELECT "alerts"."name", "alerts"."status", "alerts"."target_price" FROM "alerts" WHERE "alerts"."user_id" = $1 AND "alerts"."status" = $2  [["user_id", 1], ["status", 0]]
SELECT COUNT(*) FROM "alerts" WHERE "alerts"."user_id" = $1  [["user_id", 1]]
SELECT "alerts"."name", "alerts"."status", "alerts"."target_price" FROM "alerts" WHERE "alerts"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 1], ["OFFSET", 0]]

  def delete_by_name
    unless @user
      return render json: { success: false, message: 'please provide user_name param'}
    end
    @alert = @user.alerts.find_by(name: params[:name])
    if @alert
      @alert.update(status: :deleted)
---
SELECT "alerts".* FROM "alerts" WHERE "alerts"."user_id" = $1 AND "alerts"."name" = $2 ORDER BY "alerts"."id" ASC LIMIT $3  [["user_id", 1], ["name", "whooo"], ["LIMIT", 1]]
UPDATE "alerts" SET "status" = $1, "updated_at" = $2 WHERE "alerts"."id" = $3  [["status", 2], ["updated_at", "2024-09-11 22:39:52.237198"], ["id", 1]]

  def authenticate_user_name
    puts params, 'prrrrrrrrrrrrrrrrrrrrrrrrppp'
    @user = User.find_by(name: params[:user_name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "prasanna"], ["LIMIT", 1]]